wsdl/Importador.svc.xml

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions name="Importador" targetNamespace="http://tempuri.org/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:tns="http://tempuri.org/" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><wsdl:types><xs:schema elementFormDefault="qualified" targetNamespace="http://tempuri.org/" xmlns:xs="http://www.w3.org/2001/XMLSchema"><xs:import namespace="http://schemas.datacontract.org/2004/07/Linx.Microvix.WebApi.Importacao.Requests"/><xs:import namespace="http://schemas.datacontract.org/2004/07/Linx.Microvix.WebApi.Importacao.Api"/><xs:element name="Importar"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="request" nillable="true" type="q1:Request" xmlns:q1="http://schemas.datacontract.org/2004/07/Linx.Microvix.WebApi.Importacao.Requests"/></xs:sequence></xs:complexType></xs:element><xs:element name="ImportarResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="ImportarResult" nillable="true" type="q2:RetornoImportacao" xmlns:q2="http://schemas.datacontract.org/2004/07/Linx.Microvix.WebApi.Importacao.Api"/></xs:sequence></xs:complexType></xs:element></xs:schema><xs:schema attributeFormDefault="qualified" elementFormDefault="qualified" targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/"><xs:element name="anyType" nillable="true" type="xs:anyType"/><xs:element name="anyURI" nillable="true" type="xs:anyURI"/><xs:element name="base64Binary" nillable="true" type="xs:base64Binary"/><xs:element name="boolean" nillable="true" type="xs:boolean"/><xs:element name="byte" nillable="true" type="xs:byte"/><xs:element name="dateTime" nillable="true" type="xs:dateTime"/><xs:element name="decimal" nillable="true" type="xs:decimal"/><xs:element name="double" nillable="true" type="xs:double"/><xs:element name="float" nillable="true" type="xs:float"/><xs:element name="int" nillable="true" type="xs:int"/><xs:element name="long" nillable="true" type="xs:long"/><xs:element name="QName" nillable="true" type="xs:QName"/><xs:element name="short" nillable="true" type="xs:short"/><xs:element name="string" nillable="true" type="xs:string"/><xs:element name="unsignedByte" nillable="true" type="xs:unsignedByte"/><xs:element name="unsignedInt" nillable="true" type="xs:unsignedInt"/><xs:element name="unsignedLong" nillable="true" type="xs:unsignedLong"/><xs:element name="unsignedShort" nillable="true" type="xs:unsignedShort"/><xs:element name="char" nillable="true" type="tns:char"/><xs:simpleType name="char"><xs:restriction base="xs:int"/></xs:simpleType><xs:element name="duration" nillable="true" type="tns:duration"/><xs:simpleType name="duration"><xs:restriction base="xs:duration"><xs:pattern value="\-?P(\d*D)?(T(\d*H)?(\d*M)?(\d*(\.\d*)?S)?)?"/><xs:minInclusive value="-P10675199DT2H48M5.4775808S"/><xs:maxInclusive value="P10675199DT2H48M5.4775807S"/></xs:restriction></xs:simpleType><xs:element name="guid" nillable="true" type="tns:guid"/><xs:simpleType name="guid"><xs:restriction base="xs:string"><xs:pattern value="[\da-fA-F]{8}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{12}"/></xs:restriction></xs:simpleType><xs:attribute name="FactoryType" type="xs:QName"/><xs:attribute name="Id" type="xs:ID"/><xs:attribute name="Ref" type="xs:IDREF"/></xs:schema><xs:schema elementFormDefault="qualified" targetNamespace="http://schemas.datacontract.org/2004/07/Linx.Microvix.WebApi.Importacao.Requests" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.datacontract.org/2004/07/Linx.Microvix.WebApi.Importacao.Requests"><xs:import namespace="http://schemas.datacontract.org/2004/07/Linx.Microvix.WebApi.Business.Api"/><xs:import namespace="http://schemas.datacontract.org/2004/07/Linx.Microvix.WebApi.Importacao"/><xs:complexType name="Request"><xs:sequence><xs:element minOccurs="0" name="ParamsSeletorDestino" nillable="true" type="q1:ArrayOfCommandParameter" xmlns:q1="http://schemas.datacontract.org/2004/07/Linx.Microvix.WebApi.Business.Api"/><xs:element minOccurs="0" name="Tabela" nillable="true" type="q2:Tabela" xmlns:q2="http://schemas.datacontract.org/2004/07/Linx.Microvix.WebApi.Importacao"/><xs:element minOccurs="0" name="UserAuth" nillable="true" type="q3:UserAuthentication" xmlns:q3="http://schemas.datacontract.org/2004/07/Linx.Microvix.WebApi.Importacao"/></xs:sequence></xs:complexType><xs:element name="Request" nillable="true" type="tns:Request"/><xs:complexType name="ArrayOfRegistros"><xs:sequence><xs:element minOccurs="0" maxOccurs="unbounded" name="Registros" nillable="true" type="tns:Registros"/></xs:sequence></xs:complexType><xs:element name="ArrayOfRegistros" nillable="true" type="tns:ArrayOfRegistros"/><xs:complexType name="Registros"><xs:sequence><xs:element minOccurs="0" name="Colunas" nillable="true" type="q4:ArrayOfCommandParameter" xmlns:q4="http://schemas.datacontract.org/2004/07/Linx.Microvix.WebApi.Business.Api"/></xs:sequence></xs:complexType><xs:element name="Registros" nillable="true" type="tns:Registros"/></xs:schema><xs:schema elementFormDefault="qualified" targetNamespace="http://schemas.datacontract.org/2004/07/Linx.Microvix.WebApi.Business.Api" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.datacontract.org/2004/07/Linx.Microvix.WebApi.Business.Api"><xs:complexType name="ArrayOfCommandParameter"><xs:sequence><xs:element minOccurs="0" maxOccurs="unbounded" name="CommandParameter" nillable="true" type="tns:CommandParameter"/></xs:sequence></xs:complexType><xs:element name="ArrayOfCommandParameter" nillable="true" type="tns:ArrayOfCommandParameter"/><xs:complexType name="CommandParameter"><xs:sequence><xs:element minOccurs="0" name="Name" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="Value" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="CommandParameter" nillable="true" type="tns:CommandParameter"/></xs:schema><xs:schema elementFormDefault="qualified" targetNamespace="http://schemas.datacontract.org/2004/07/Linx.Microvix.WebApi.Importacao" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.datacontract.org/2004/07/Linx.Microvix.WebApi.Importacao"><xs:import namespace="http://schemas.datacontract.org/2004/07/Linx.Microvix.WebApi.Importacao.Requests"/><xs:complexType name="Tabela"><xs:sequence><xs:element minOccurs="0" name="Comando" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="Registros" nillable="true" type="q1:ArrayOfRegistros" xmlns:q1="http://schemas.datacontract.org/2004/07/Linx.Microvix.WebApi.Importacao.Requests"/></xs:sequence></xs:complexType><xs:element name="Tabela" nillable="true" type="tns:Tabela"/><xs:complexType name="UserAuthentication"><xs:sequence><xs:element minOccurs="0" name="Pass" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="User" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="UserAuthentication" nillable="true" type="tns:UserAuthentication"/></xs:schema><xs:schema elementFormDefault="qualified" targetNamespace="http://schemas.datacontract.org/2004/07/Linx.Microvix.WebApi.Importacao.Api" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.datacontract.org/2004/07/Linx.Microvix.WebApi.Importacao.Api"><xs:import namespace="http://schemas.microsoft.com/2003/10/Serialization/Arrays"/><xs:complexType name="RetornoImportacao"><xs:sequence><xs:element minOccurs="0" name="Mensagem" nillable="true" type="q1:ArrayOfstring" xmlns:q1="http://schemas.microsoft.com/2003/10/Serialization/Arrays"/><xs:element minOccurs="0" name="Succeeded" type="xs:boolean"/></xs:sequence></xs:complexType><xs:element name="RetornoImportacao" nillable="true" type="tns:RetornoImportacao"/></xs:schema><xs:schema elementFormDefault="qualified" targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/Arrays" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/Arrays"><xs:complexType name="ArrayOfstring"><xs:sequence><xs:element minOccurs="0" maxOccurs="unbounded" name="string" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="ArrayOfstring" nillable="true" type="tns:ArrayOfstring"/></xs:schema></wsdl:types><wsdl:message name="IImportador_Importar_InputMessage"><wsdl:part name="parameters" element="tns:Importar"/></wsdl:message><wsdl:message name="IImportador_Importar_OutputMessage"><wsdl:part name="parameters" element="tns:ImportarResponse"/></wsdl:message><wsdl:portType name="IImportador"><wsdl:operation name="Importar"><wsdl:input wsaw:Action="http://tempuri.org/IImportador/Importar" message="tns:IImportador_Importar_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IImportador/ImportarResponse" message="tns:IImportador_Importar_OutputMessage"/></wsdl:operation></wsdl:portType><wsdl:binding name="BasicHttpBinding_IImportador" type="tns:IImportador"><soap:binding transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="Importar"><soap:operation soapAction="http://tempuri.org/IImportador/Importar" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding><wsdl:service name="Importador"><wsdl:port name="BasicHttpBinding_IImportador" binding="tns:BasicHttpBinding_IImportador"><soap:address location="http://webapi.microvix.com.br/1.0/Importador.svc"/></wsdl:port></wsdl:service></wsdl:definitions>